/*******************************************************************************
 *   Revised:        All copyrights reserved to redmorningcn.
 *   Revision:       v1.0
 *   Writer:	     redmorningcn.
 *
 *   Description:    设置统计模块参数。 
 *   Notes:
 *     				E-mail: redmorningcn@qq.com
 *
 *******************************************************************************/

#ifndef	SET_PARA_H
#define	SET_PARA_H


/********************************************************************************************/
/* Include files																			*/
/********************************************************************************************/
#include "cvi_setpara.h"

#include "includes.h"
#include "app_type.h"



#include "modedata.h"   
#include "cvi_config.h"


/********************************************************************************************/
/* Constants																					*/
/********************************************************************************************/
//uir文件名
//uir文件名
#define		UIR_SETPARA_NAME		"cvi_setpara.uir"
//参数配置文件名																																									                             
#define		MAX_PATHNAME_LEN		512
#define		SETPRAR_FILE_NAME		"cvi_setpara.ini"

#define		CMD_TIME_SET        0x00000100			//时间卡（IC/无线）
#define		CMD_LOCO_SET        0x00002000			//装车卡（IC/无线）
#define		CMD_REC_CLR			0x00080000			//记录清零（无线）
#define		CMD_SYS_RST	        0x00100000		    //系统复位（无线）
#define		CMD_PARA_SET        0x00800000		    //写参数（无线）
#define		CMD_PARA_GET        0x00800001		    //读参数（无线）
#define		CMD_RECORD_GET      0x01000001		    //读数据记录（无线）
#define		CMD_DETECT_SET      0x02000000		    //读检测板参数（无线）
#define		CMD_DETECT_GET      0x02000001		    //写检测板参数（无线）





//定义打开配置串口空间名称


/********************************************************************************************/
//结构体																				    */
/********************************************************************************************/

//时间----------------------------------------
typedef		struct	_stcTime_
{
	uint8_t	Sec;
	uint8_t	Min;
	uint8_t	Hour;
	uint8_t	Date;
	uint8_t	Month;
	uint8_t	Year;
	uint16_t	CrcCheck;
}stcTime;
 


//产品信息:型号 + 编号
//12 bytes
typedef struct _StrParaRd {
    u16         paraaddr;							//地址	
    u16         paralen;							//长度
    u16         parabuf[64]; 
}StrTargetPara;

/********************************************************************************************/
/* Globals																					*/
/********************************************************************************************/
//串口结构体及通讯
extern	int				l_eqiupmentcode;			//装置命令码，操作面板控制
extern	StrProductInfo  gstrProductInfo;			//产品参数
extern	StrTargetPara	gstrTargetPara;				//指定地址参数读


/********************************************************************************************/
/* Prototypes																				*/
/********************************************************************************************/

/********************************************************************************************/
/* 串口设置参数      																		*/
//通过l_eqiupmentcode变量控制设置过程。
//此函数需要循环执行，且能外部设置 l_eqiupmentcode
/********************************************************************************************/
void 	Com_SetParaTask(void);		

/********************************************************************************************/
//载并显示面板。	redmoringcn 20170930						            
/********************************************************************************************/
void 	LoadCsncSetparaPanel(void);

/********************************************************************************************/
//读系统时间，转换为stcTime结构
/********************************************************************************************/
void     ReadTime(stcTime * sTime);

/*******************************************************************************
 *              end of file                                                    *
 *******************************************************************************/

#endif
